tiborsimon/embedded-tdd-headers/pic/8bit/pic18f24k22_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18F24K22_H_
#define _PIC18F24K22_H_

#define ANSELA                        0
#define ANSA0                         1
#define ANSA1                         2
#define ANSA2                         3
#define ANSA3                         4
#define ANSA5                         5
#define ANSELB                        6
#define ANSB0                         7
#define ANSB1                         8
#define ANSB2                         9
#define ANSB3                         10
#define ANSB4                         11
#define ANSB5                         12
#define ANSELC                        13
#define ANSC2                         14
#define ANSC3                         15
#define ANSC4                         16
#define ANSC5                         17
#define ANSC6                         18
#define ANSC7                         19
#define PMD2                          20
#define ADCMD                         21
#define CMP1MD                        22
#define CMP2MD                        23
#define CTMUMD                        24
#define PMD1                          25
#define EMBMD                         26
#define CCP1MD                        27
#define CCP2MD                        28
#define CCP3MD                        29
#define CCP4MD                        30
#define CCP5MD                        31
#define MSSP1MD                       32
#define MSSP2MD                       33
#define PMD0                          34
#define TMR1MD                        35
#define SPI1MD                        36
#define TMR2MD                        37
#define SPI2MD                        38
#define TMR3MD                        39
#define TMR4MD                        40
#define TMR5MD                        41
#define TMR6MD                        42
#define UART1MD                       43
#define UART2MD                       44
#define VREFCON2                      45
#define DACR0                         46
#define DACR                          47
#define DACR1                         48
#define DACR2                         49
#define DACR3                         50
#define DACR4                         51
#define VREFCON1                      52
#define DACNSS                        53
#define DACPSS                        54
#define DACPSS0                       55
#define DACPSS1                       56
#define DACOE                         57
#define DACLPS                        58
#define DACEN                         59
#define VREFCON0                      60
#define FVRS                          61
#define FVRS0                         62
#define FVRS1                         63
#define FVRST                         64
#define FVREN                         65
#define CTMUICON                      66
#define IRNG                          67
#define IRNG0                         68
#define IRNG1                         69
#define ITRIM0                        70
#define ITRIM                         71
#define ITRIM1                        72
#define ITRIM2                        73
#define ITRIM3                        74
#define ITRIM4                        75
#define ITRIM5                        76
#define CTMUCONL                      77
#define EDG1STAT                      78
#define EDG2STAT                      79
#define EDG1SEL                       80
#define EDG1SEL0                      81
#define EDG1SEL1                      82
#define EDG1POL                       83
#define EDG2SEL0                      84
#define EDG2SEL                       85
#define EDG2SEL1                      86
#define EDG2POL                       87
#define CTMUCONH                      88
#define CTTRIG                        89
#define IDISSEN                       90
#define EDGSEQEN                      91
#define EDGEN                         92
#define TGEN                          93
#define CTMUSIDL                      94
#define CTMUEN                        95
#define SRCON1                        96
#define SRRC1E                        97
#define SRRC2E                        98
#define SRRCKE                        99
#define SRRPE                         100
#define SRSC1E                        101
#define SRSC2E                        102
#define SRSCKE                        103
#define SRSPE                         104
#define SRCON0                        105
#define SRPR                          106
#define SRPS                          107
#define SRNQEN                        108
#define SRQEN                         109
#define SRCLK0                        110
#define SRCLK                         111
#define SRCLK1                        112
#define SRCLK2                        113
#define SRLEN                         114
#define CCPTMRS1                      115
#define C4TSEL                        116
#define C4TSEL0                       117
#define C4TSEL1                       118
#define C5TSEL                        119
#define C5TSEL0                       120
#define C5TSEL1                       121
#define CCPTMRS0                      122
#define C1TSEL0                       123
#define C1TSEL                        124
#define C1TSEL1                       125
#define C2TSEL0                       126
#define C2TSEL                        127
#define C2TSEL1                       128
#define C3TSEL0                       129
#define C3TSEL                        130
#define C3TSEL1                       131
#define T6CON                         132
#define T6CKPS0                       133
#define T6CKPS                        134
#define T6CKPS1                       135
#define TMR6ON                        136
#define T6OUTPS0                      137
#define T6OUTPS                       138
#define T6OUTPS1                      139
#define T6OUTPS2                      140
#define T6OUTPS3                      141
#define PR6                           142
#define TMR6                          143
#define T5GCON                        144
#define T5GSS                         145
#define T5GSS0                        146
#define T5GSS1                        147
#define T5GVAL                        148
#define T5G_DONE                      149
#define T5GGO_NOT_DONE                150
#define T5GGO_nDONE                   151
#define T5GGO                         152
#define T5GSPM                        153
#define T5GTM                         154
#define T5GPOL                        155
#define TMR5GE                        156
#define T5CON                         157
#define TMR5ON                        158
#define T5RD16                        159
#define RD165                         160
#define T5SYNC                        161
#define nT5SYNC                       162
#define NOT_T5SYNC                    163
#define SOSCEN5                       164
#define T5SOSCEN                      165
#define T5CKPS                        166
#define T5CKPS0                       167
#define T5CKPS1                       168
#define TMR5CS0                       169
#define TMR5CS                        170
#define TMR5CS1                       171
#define TMR5L                         172
#define TMR5H                         173
#define T4CON                         174
#define T4CKPS0                       175
#define T4CKPS                        176
#define T4CKPS1                       177
#define TMR4ON                        178
#define T4OUTPS                       179
#define T4OUTPS0                      180
#define T4OUTPS1                      181
#define T4OUTPS2                      182
#define T4OUTPS3                      183
#define PR4                           184
#define TMR4                          185
#define CCP5CON                       186
#define CCP5M0                        187
#define CCP5M                         188
#define CCP5M1                        189
#define CCP5M2                        190
#define CCP5M3                        191
#define DC5B0                         192
#define DC5B                          193
#define DC5B1                         194
#define CCPR5L                        195
#define CCPR5H                        196
#define CCP4CON                       197
#define CCP4M                         198
#define CCP4M0                        199
#define CCP4M1                        200
#define CCP4M2                        201
#define CCP4M3                        202
#define DC4B0                         203
#define DC4B                          204
#define DC4B1                         205
#define CCPR4L                        206
#define CCPR4H                        207
#define PSTR3CON                      208
#define STR3A                         209
#define STRA3                         210
#define STRB3                         211
#define STR3B                         212
#define STR3C                         213
#define STRC3                         214
#define STR3D                         215
#define STRD3                         216
#define STRSYNC3                      217
#define STR3SYNC                      218
#define ECCP3AS                       219
#define P3SSBD0                       220
#define PSS3BD0                       221
#define PSS3BD                        222
#define P3SSBD                        223
#define P3SSBD1                       224
#define PSS3BD1                       225
#define P3SSAC                        226
#define P3SSAC0                       227
#define PSS3AC0                       228
#define PSS3AC                        229
#define P3SSAC1                       230
#define PSS3AC1                       231
#define CCP3AS                        232
#define CCP3AS0                       233
#define CCP3AS1                       234
#define CCP3AS2                       235
#define CCP3ASE                       236
#define PWM3CON                       237
#define P3DC                          238
#define P3DC0                         239
#define P3DC1                         240
#define P3DC2                         241
#define P3DC3                         242
#define P3DC4                         243
#define P3DC5                         244
#define P3DC6                         245
#define P3RSEN                        246
#define CCP3CON                       247
#define CCP3M                         248
#define CCP3M0                        249
#define CCP3M1                        250
#define CCP3M2                        251
#define CCP3M3                        252
#define DC3B                          253
#define DC3B0                         254
#define DC3B1                         255
#define P3M                           256
#define P3M0                          257
#define P3M1                          258
#define CCPR3L                        259
#define CCPR3H                        260
#define SLRCON                        261
#define SLRA                          262
#define SLRB                          263
#define SLRC                          264
#define WPUB                          265
#define WPUB0                         266
#define WPUB1                         267
#define WPUB2                         268
#define WPUB3                         269
#define WPUB4                         270
#define WPUB5                         271
#define WPUB6                         272
#define WPUB7                         273
#define IOCB                          274
#define IOCB4                         275
#define IOCB5                         276
#define IOCB6                         277
#define IOCB7                         278
#define PSTR2CON                      279
#define STR2A                         280
#define P2DC02                        281
#define STRA2                         282
#define P2DC0CON                      283
#define STR2B                         284
#define P2DC1CON                      285
#define P2DC12                        286
#define STRB2                         287
#define STR2C                         288
#define STRC2                         289
#define P2DC22                        290
#define P2DC2CON                      291
#define P2DC32                        292
#define STR2D                         293
#define STRD2                         294
#define P2DC3CON                      295
#define P2DC42                        296
#define STR2SYNC                      297
#define P2DC4CON                      298
#define STRSYNC2                      299
#define ECCP2AS                       300
#define PSS2BD                        301
#define PSS2BD0                       302
#define P2SSBD                        303
#define P2SSBD0                       304
#define PSS2BD1                       305
#define P2SSBD1                       306
#define PSS2AC0                       307
#define P2SSAC                        308
#define P2SSAC0                       309
#define PSS2AC                        310
#define PSS2AC1                       311
#define P2SSAC1                       312
#define CCP2AS                        313
#define CCP2AS0                       314
#define CCP2AS1                       315
#define CCP2AS2                       316
#define CCP2ASE                       317
#define PWM2CON                       318
#define P2DC                          319
#define P2DC0                         320
#define P2DC1                         321
#define P2DC2                         322
#define P2DC3                         323
#define P2DC4                         324
#define P2DC5                         325
#define P2DC6                         326
#define P2RSEN                        327
#define CCP2CON                       328
#define CCP2M                         329
#define CCP2M0                        330
#define CCP2M1                        331
#define CCP2M2                        332
#define CCP2M3                        333
#define DC2B                          334
#define DC2B0                         335
#define DC2B1                         336
#define P2M                           337
#define P2M0                          338
#define P2M1                          339
#define CCPR2L                        340
#define CCPR2H                        341
#define SSP2CON3                      342
#define SSP2CON3_DHEN                 343
#define SSP2CON3_AHEN                 344
#define SSP2CON3_SBCDE                345
#define SSP2CON3_SDAHT                346
#define SSP2CON3_BOEN                 347
#define SSP2CON3_SCIE                 348
#define SSP2CON3_PCIE                 349
#define SSP2CON3_ACKTIM               350
#define SSP2MSK                       351
#define SSP2MSK_MSK0                  352
#define SSP2MSK_MSK1                  353
#define SSP2MSK_MSK2                  354
#define SSP2MSK_MSK3                  355
#define SSP2MSK_MSK4                  356
#define SSP2MSK_MSK5                  357
#define SSP2MSK_MSK6                  358
#define SSP2MSK_MSK7                  359
#define SSP2CON2                      360
#define SEN2                          361
#define SSP2CON2_SEN                  362
#define ADMSK12                       363
#define SSP2CON2_RSEN                 364
#define RSEN2                         365
#define ADMSK22                       366
#define PEN2                          367
#define SSP2CON2_PEN                  368
#define ADMSK32                       369
#define SSP2CON2_RCEN                 370
#define RCEN2                         371
#define ACKEN2                        372
#define ADMSK42                       373
#define SSP2CON2_ACKEN                374
#define ACKDT2                        375
#define ADMSK52                       376
#define SSP2CON2_ACKDT                377
#define SSP2CON2_ACKSTAT              378
#define ACKSTAT2                      379
#define GCEN2                         380
#define SSP2CON2_GCEN                 381
#define SSP2CON1                      382
#define SSP2CON1_SSPM                 383
#define SSP2CON1_SSPM0                384
#define SSPM02                        385
#define SSPM12                        386
#define SSP2CON1_SSPM1                387
#define SSP2CON1_SSPM2                388
#define SSPM22                        389
#define SSPM32                        390
#define SSP2CON1_SSPM3                391
#define SSP2CON1_CKP                  392
#define CKP2                          393
#define SSPEN2                        394
#define SSP2CON1_SSPEN                395
#define SSPOV2                        396
#define SSP2CON1_SSPOV                397
#define WCOL2                         398
#define SSP2CON1_WCOL                 399
#define SSP2STAT                      400
#define SSP2STAT_BF                   401
#define BF2                           402
#define SSP2STAT_UA                   403
#define UA2                           404
#define SSP2STAT_R_W                  405
#define RW2                           406
#define SSP2STAT_R                    407
#define READ_WRITE2                   408
#define nW2                           409
#define SSP2STAT_nW                   410
#define SSP2STAT_W                    411
#define SSP2STAT_nWRITE               412
#define I2C_READ2                     413
#define SSP2STAT_R_NOT_W              414
#define R_nW2                         415
#define nWRITE2                       416
#define R_W2                          417
#define SSP2STAT_R_nW                 418
#define SSP2STAT_NOT_WRITE            419
#define SSP2STAT_S                    420
#define S2                            421
#define START2                        422
#define I2C_START2                    423
#define SSP2STAT_P                    424
#define P2                            425
#define STOP2                         426
#define I2C_STOP2                     427
#define SSP2STAT_D                    428
#define SSP2STAT_A                    429
#define DA2                           430
#define DATA_ADDRESS2                 431
#define SSP2STAT_NOT_ADDRESS          432
#define SSP2STAT_D_NOT_A              433
#define D_A2                          434
#define SSP2STAT_D_nA                 435
#define SSP2STAT_nADDRESS             436
#define nA2                           437
#define I2C_DAT2                      438
#define nADDRESS2                     439
#define SSP2STAT_nA                   440
#define SSP2STAT_D_A                  441
#define D_nA2                         442
#define SSP2STAT_CKE                  443
#define CKE2                          444
#define SSP2STAT_SMP                  445
#define SMP2                          446
#define SSP2ADD                       447
#define MSK02                         448
#define SSP2ADD_SSPADD                449
#define MSK12                         450
#define MSK22                         451
#define MSK32                         452
#define MSK42                         453
#define MSK52                         454
#define MSK62                         455
#define MSK72                         456
#define SSP2BUF                       457
#define SSP2BUF_SSPBUF                458
#define BAUDCON2                      459
#define BAUDCON2_ABDEN                460
#define ABDEN2                        461
#define WUE2                          462
#define BAUDCON2_WUE                  463
#define BRG162                        464
#define BAUDCON2_BRG16                465
#define BAUDCON2_SCKP                 466
#define SCKP2                         467
#define BAUDCON2_CKTXP                468
#define TXCKP2                        469
#define DTRXP2                        470
#define RXDTP2                        471
#define BAUDCON2_DTRXP                472
#define RCMT2                         473
#define RCIDL2                        474
#define BAUDCON2_RCIDL                475
#define BAUDCON2_ABDOVF               476
#define ABDOVF2                       477
#define RCSTA2                        478
#define RCD82                         479
#define RX9D2                         480
#define RCSTA2_RX9D                   481
#define RCSTA2_OERR                   482
#define OERR2                         483
#define FERR2                         484
#define RCSTA2_FERR                   485
#define RCSTA2_ADEN                   486
#define ADDEN2                        487
#define RCSTA2_ADDEN                  488
#define RCSTA2_CREN                   489
#define CREN2                         490
#define SREN2                         491
#define RCSTA2_SREN                   492
#define RC92                          493
#define RC8_92                        494
#define RCSTA2_RX9                    495
#define RX92                          496
#define RCSTA2_SPEN                   497
#define SPEN2                         498
#define TXSTA2                        499
#define TX9D2                         500
#define TXSTA2_TX9D                   501
#define TXD82                         502
#define TRMT2                         503
#define TXSTA2_TRMT                   504
#define BRGH2                         505
#define TXSTA2_BRGH                   506
#define SENDB2                        507
#define TXSTA2_SENDB                  508
#define TXSTA2_SYNC                   509
#define SYNC2                         510
#define TXEN2                         511
#define TXSTA2_TXEN                   512
#define TX8_92                        513
#define TX92                          514
#define TXSTA2_TX9                    515
#define TXSTA2_CSRC                   516
#define CSRC2                         517
#define TXREG2                        518
#define TX2REG                        519
#define RCREG2                        520
#define RC2REG                        521
